Revit 2024 API
ElectricalAnalyticalLoadSet.GetLoadIds Method
 Gets Equipment Load ids in the LoadSet.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ISet<ElementId> GetLoadIds()
Visual Basic
Public Function GetLoadIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetLoadIds()
Return Value
 The Equipment Load ids.
See Also
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace